Autodesk.Revit.DB.DirectShapeTypeOptions.IsEqualTo(Autodesk.Revit.DB.DirectShapeTypeOptions)
Compare this object with the one supplied as argument.
Return true if the options specified by both objects are the same.
other:
the DirectShapeTypeOptions object to be compared.
Returns:
True if both objects specify the same options.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021